Охотники_и_рыболовы/src/Documents/УстановкаОграниченийИЦен/УстановкаОграниченийИЦен.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаОграниченийИЦен</name>
  <registerRecords>InformationRegister.ЦеныПоВидамДичи</registerRecords>
  <registerRecords>InformationRegister.ОграниченияДичиНаДобычу</registerRecords>
  <attributes>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаШтатнымСотрудникам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВетеранамВойны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаИнвалидамПервойГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаПослеВозрастногоПорога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Общая</name>
    <attributes>
      <name>ВидДичи</name>
      <type>
        <types>CatalogRef.ВидыДичи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСвоимРазовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаСвоимСезонная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЧужимРазовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаЧужимСезонная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоГосБилетРазовая</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоГосБилетСезонная</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ДействиеОсобыхЦен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТолькоСезонная</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Дичь</name>
      <type>
        <types>CatalogRef.ГруппыДичи</types>
        <types>CatalogRef.Дичь</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Ограничено</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоВДень</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЗаСезон</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязи</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Охотники_и_рыболовы/src/InformationRegisters/ЦеныПоВидамДичи/ЦеныПоВидамДичи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныПоВидамДичи</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ЦенаСвоимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаСвоимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаЧужимСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетРазовая</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоГосБилетСезонная</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаШтатнымСотрудникам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаВетеранамВойны</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаИнвалидамПервойГруппы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЦенаПослеВозрастногоПорога</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТолькоСезонная</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДействиеОсобыхЦен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/InformationRegisters/ОграниченияДичиНаДобычу/ОграниченияДичиНаДобычу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОграниченияДичиНаДобычу</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>КоличествоВДень</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоЗаСезон</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ограничено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючСвязи</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>СезонОхоты</name>
    <type>
      <types>CatalogRef.СезоныОхоты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидДичи</name>
    <type>
      <types>CatalogRef.ВидыДичи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Дичь</name>
    <type>
      <types>CatalogRef.ГруппыДичи</types>
      <types>CatalogRef.Дичь</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Охотники_и_рыболовы/src/Documents/УстановкаОграниченийИЦен/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.ЦеныПоВидамДичи.Записывать = Истина;
	Движения.ЦеныПоВидамДичи.Очистить();
	Движения.ОграниченияДичиНаДобычу.Записывать = Истина;
	Движения.ОграниченияДичиНаДобычу.Очистить();

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЧСостав.Дичь,
		|	ТЧСостав.ДатаНачала,
		|	ТЧСостав.ДатаОкончания,
		|	ТЧСостав.Ограничено,
		|	ТЧСостав.КоличествоВДень,
		|	ТЧСостав.КоличествоЗаСезон,
		|	ТЧОбщая.ВидДичи,
		|	ТЧСостав.НомерСтроки КАК НомерСтроки,
		|	ТЧСостав.КлючСвязи
		|ИЗ
		|	Документ.УстановкаОграниченийИЦен.Общая КАК ТЧОбщая
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.УстановкаОграниченийИЦен.Состав КАК ТЧСостав
		|		ПО ТЧОбщая.КлючСвязи = ТЧСостав.КлючСвязи
		|ГДЕ
		|	ТЧОбщая.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЧСостав.Дичь,
		|	ТЧСостав.ДатаНачала,
		|	ТЧСостав.ДатаОкончания,
		|	ТЧСостав.Ограничено,
		|	ТЧСостав.КоличествоВДень,
		|	ТЧСостав.КоличествоЗаСезон,
		|	ТЧОбщая.ВидДичи,
		|	ТЧСостав.НомерСтроки,
		|	ТЧСостав.КлючСвязи
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерСтроки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	УстановкаОграниченийИЦенОбщая.ВидДичи,
		|	УстановкаОграниченийИЦенОбщая.ДатаНачала,
		|	УстановкаОграниченийИЦенОбщая.ДатаОкончания,
		|	УстановкаОграниченийИЦенОбщая.ЦенаСвоимРазовая,
		|	УстановкаОграниченийИЦенОбщая.ЦенаСвоимСезонная,
		|	УстановкаОграниченийИЦенОбщая.ЦенаЧужимРазовая,
		|	УстановкаОграниченийИЦенОбщая.ЦенаЧужимСезонная,
		|	УстановкаОграниченийИЦенОбщая.ТолькоГосБилетРазовая,
		|	УстановкаОграниченийИЦенОбщая.ТолькоГосБилетСезонная,
		|	УстановкаОграниченийИЦенОбщая.Ссылка.ЦенаШтатнымСотрудникам,
		|	УстановкаОграниченийИЦенОбщая.Ссылка.ЦенаВетеранамВойны,
		|	УстановкаОграниченийИЦенОбщая.Ссылка.ЦенаИнвалидамПервойГруппы,
		|	УстановкаОграниченийИЦенОбщая.Ссылка.ЦенаПослеВозрастногоПорога,
		|	УстановкаОграниченийИЦенОбщая.ДействиеОсобыхЦен,
		|	УстановкаОграниченийИЦенОбщая.ТолькоСезонная,
		|	УстановкаОграниченийИЦенОбщая.КлючСвязи
		|ИЗ
		|	Документ.УстановкаОграниченийИЦен.Общая КАК УстановкаОграниченийИЦенОбщая";
	
		
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	Результат = Запрос.ВыполнитьПакет();
	
	ВыборкаСостав = Результат[0].Выбрать();
	ВыборкаОбщая = Результат[1].Выбрать();
	
	
	Пока ВыборкаОбщая.Следующий() Цикл
		Движение = Движения.ЦеныПоВидамДичи.Добавить();
		Движение.Период 		= НачалоДня(Дата);
		Движение.СезонОхоты 	= СезонОхоты;
		Движение.Регистратор	= Ссылка;
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаОбщая);
	КонецЦикла;
	
	Пока ВыборкаСостав.Следующий() Цикл
		Движение = Движения.ОграниченияДичиНаДобычу.Добавить();
		Движение.Период 		= НачалоДня(Дата);
		Движение.СезонОхоты 	= СезонОхоты;
		Движение.Регистратор 	= Ссылка;
		ЗаполнитьЗначенияСвойств(Движение,ВыборкаСостав);
	КонецЦикла;

	
КонецПроцедуры
